[{
    "role": "Product Engineering Manager",
    "company": "Hyatt Hotels Corporation",
    "period": "Oct 2017 - Present",
    "logo": "https://media.licdn.com/dms/image/v2/D560BAQHZVNCUIfytag/company-logo_100_100/company-logo_100_100/0/1719848403661/hyatt_logo?e=1752105600&v=beta&t=1sJHRk1Gws-d_g3B1NMUkRtUxJ3mufw2Nqsjz9L2QoY",
    "shortDescription": "Driving digital transformation at Hyatt by leading engineering teams to modernize platforms, automate operations, and deliver secure, scalable solutions for global hospitality.",
    "tools": ["React", "Next.js", "Node.js", "Azure", "Datadog"],
    "responsibilities": [
      "<strong>Strategic Modernization:</strong> Led migration from Node.js to React/Next.js and cloud (Opera V5 to OHIP), enabling scalable APIs and future-ready platforms.",
      "<strong>Team Leadership:</strong> Managed and mentored an 8-member engineering team, driving growth, inclusion, and technical excellence.",
      "<strong>Process Automation:</strong> Built dashboards (Pre-Arrivals, Group Arrivals, F&B) to automate workflows, reducing team workload by 20%.",
      "<strong>Project Highlight – Pre-Arrivals Dashboard:</strong> Automated guest management with a React/Next.js dashboard (Azure, Datadog), cutting manual work by 20% and improving real-time accuracy.",
      "<strong>System Integration:</strong> Integrated 13+ internal/external systems to streamline data exchange and optimize operations.",
      "<strong>Security & Compliance:</strong> Led Azure AD MFA integration and ensured PCI/PII compliance across all apps.",
      "<strong>Observability:</strong> Implemented Datadog monitoring, reducing incident response times by 30%.",
      "<strong>DevOps Transformation:</strong> Migrated to Datadog and GitLab, optimizing CI/CD and accelerating deployments.",
      "<strong>Stakeholder Partnership:</strong> Collaborated with product, business, and vendors to align technical roadmaps with business goals."
    ]
  },
  {
    "role": "Senior Frontend Engineer",
    "company": "Tracfone Wireless",
    "period": "2016 - 2017",
    "shortDescription": "Transformed Tracfone’s digital presence by leading the migration from IBM Portal to a high-performance Angular SPA, enhancing user experience and site engagement.",
    "tools": ["Angular", "Google Analytics", "Karma/Jasmine", "Protractor"],
    "responsibilities": [
      "<strong>Front-End Modernization:</strong> Redesigned and migrated web platforms, boosting performance and enabling mobile-first, responsive design.",
      "<strong>Analytics & SEO:</strong> Integrated Google Analytics and Tag Manager, increasing site engagement and search visibility.",
      "<strong>Automation:</strong> Developed modular Angular components and automated testing pipelines (Protractor, Karma/Jasmine), reducing regression testing time by 40%.",
      "<strong>Global Collaboration:</strong> Worked with offshore teams to align code quality, testing standards, and deployment best practices."
    ]
  },
  {
    "role": "Programmer Analyst",
    "company": "Cognizant Technology Solutions",
    "client": "Hasbro",
    "period": "2011 - 2015",
    "shortDescription": "Led digital transformation projects for Hasbro, managing large-scale website migrations and launching new digital brands in a fast-paced, Agile environment.",
    "tools": ["JavaScript", "WCAG", "Omniture", "Google Analytics"],
    "responsibilities": [
      "<strong>Global Content Delivery:</strong> Oversaw multilingual content deployment for 32+ locales, ensuring timely releases and compliance with accessibility and SEO standards.",
      "<strong>Analytics & Accessibility:</strong> Integrated Omniture and Google Analytics for performance tracking; enforced WCAG compliance to enhance digital usability across devices.",
      "<strong>Brand Launches:</strong> Designed and launched new digital brands, managing end-to-end development and deployment."
    ]
  }
]